In [1]:
import numpy as np
import pandas as pd
data=pd.DataFrame({
    "name":["srinivas","bhaskara","swamy"],"id":[279,282,np.nan]
})
data

       name     id
0  srinivas  279.0
1  bhaskara  282.0
2     swamy    NaN

In [2]:
data.fillna("323")

       name     id
0  srinivas  279.0
1  bhaskara  282.0
2     swamy    323

In [9]:
data=pd.DataFrame({
    "name":["srinivas",np.nan,"swamy"],"id":[279,282,np.nan]
})

In [10]:
data.dropna()

       name     id
0  srinivas  279.0

In [5]:
data.dropna(axis=0)

       name     id
0  srinivas  279.0
1  bhaskara  282.0

In [6]:
data.dropna(axis=1)

       name
0  srinivas
1  bhaskara
2     swamy

In [11]:
data["name"].fillna("dsd")

0    srinivas
1         dsd
2       swamy
Name: name, dtype: object

In [12]:
data["name"].replace(np.nan,"nag")

0    srinivas
1         nag
2       swamy
Name: name, dtype: object

In [13]:
data.dropna(how="all",axis=1)

       name     id
0  srinivas  279.0
1       NaN  282.0
2     swamy    NaN

In [15]:
data.dropna(thresh=1)

       name     id
0  srinivas  279.0
1       NaN  282.0
2     swamy    NaN

In [16]:
d=np.arange(0,11,1)
k=pd.cut(d,[-1,5,10],labels=["low","high"])
print(k)

['low', 'low', 'low', 'low', 'low', ..., 'high', 'high', 'high', 'high', 'high']
Length: 11
Categories (2, object): ['low' < 'high']